Revit 2022 API
Element.GetExternalResourceReferences Method
 Gets the full map of the external resource references referenced by the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public IDictionary<ExternalResourceType, ExternalResourceReference> GetExternalResourceReferences()
Visual Basic
Public Function GetExternalResourceReferences As IDictionary(Of ExternalResourceType, ExternalResourceReference)
Visual C++
public:
IDictionary<ExternalResourceType^, ExternalResourceReference^>^ GetExternalResourceReferences()
Return Value
 The full map of the external resource references referenced by the element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This Element does not use any external resource.
See Also
Element Class
Autodesk.Revit.DB Namespace